{
  "该箱码被用户' + @cacheuser + N'扫描，请提醒其操作!": "The box code has been scanned by user ' + @cacheuser + N'. Please remind them to take action!",
  "发运单已经收货，不能重复收货!": "The shipment has already been received and cannot be received again!",
  "发运单，必须打印报检单!": "For the shipping order, the inspection report must be printed!",
  "没有任何有效标签，不允许收货!": "No valid labels, receipt not allowed!",
  "箱码中数量不能为0!": "The quantity in the box code cannot be 0!",
  "收货完成!": "Receipt completed!",
  "发运单状态不正确!": "The shipment order status is incorrect!",
  "发运单使用单箱收货功能并且缓存了标签,请先解除缓存!": "The shipment order uses the single-box receiving function and has cached labels. Please clear the cache first!",
  "发运单对应的标签已经上架，请使用单箱退货!": "The label corresponding to the shipment order has already been shelved. Please use single-box return!",
  "退货完成!": "Return completed!",
  "标签不存在!": "Tag does not exist!",
  "已经使用了单箱退货，不能使用订单行退货!": "Single box return has already been used, order line return cannot be used!",
  "发运单对应的标签状态不正确!": "The label status corresponding to the shipment order is incorrect!",
  "提交成功!": "Submission successful!",
  "标签不合法!": "Invalid tag!",
  "没有扫描任何标签!": "No tags scanned!",
  "拆分数量不能为空!": "The split quantity cannot be empty!",
  "拆分数量不合法!": "Invalid split quantity!",
  "请扫描标签 !": "Please scan the label!",
  "第一箱和第二箱箱码不能相同 !": "The box codes for the first and second boxes cannot be the same!",
  "数量溢出请明日再拆分!": "Quantity overflow, please split again tomorrow!",
  "新标签生成失败!": "Failed to generate a new tag!",
  "标签批次不能为空!": "Label batch cannot be empty!",
  "第二张标签和第一张标签零件号,库位,供应商不匹配!": "The part number, storage location, and supplier of the second label do not match those of the first label!",
  "合并出错，没有生成新标签 !": "Merge error, no new tag generated!",
  "第二张标签和第一张标签零件号,库位,客户不匹配!": "The part number, storage location, and customer of the second label do not match those of the first label!",
  "必须选择检验状态!": "You must select a verification status!",
  "判定完成!": "Judgment completed!",
  "标签关联的质检单不存在!": "The quality inspection sheet associated with the tag does not exist!",
  "标签不存在或者状态不正确!": "The tag does not exist or the status is incorrect!",
  "标签关联的质检单已经检验!": "The inspection sheet associated with the label has already been inspected!",
  "质检单不存在!": "The quality inspection sheet does not exist!",
  "不能临时修改到库位!": "Temporary modification to the storage location is not allowed!",
  "您没有扫描任何标签!": "You have not scanned any tags!",
  "上架完成!": "Listing completed!",
  "库位不存在!": "Location does not exist!",
  "标签不正确或未检验判定!": "Incorrect or unverified label!",
  "标签库位不能为空!": "The label location cannot be empty!",
  "到库位不能为空!": "The destination location cannot be empty!",
  "不合格品不能上架!": "Non-conforming products cannot be listed!",
  "当前零件未激活，请先到QAD激活!": "The current part is not activated. Please activate it in QAD first!",
  "当前标签对应的质检单不存在!": "The quality inspection sheet corresponding to the current label does not exist!",
  "当前标签对应的质检单未检验，或者检验不合格!": "The quality inspection sheet corresponding to the current label has not been inspected or has failed inspection!",
  "从库位和到库位的库区相同，不能生成上架队列!": "The source and destination storage areas are the same, unable to generate the shelving queue!",
  "不能重复扫描当前标签!": "Cannot scan the current label again!",
  "到库位不能是产线库位!": "The destination location cannot be a production line location!",
  "移库完成!": "Relocation completed!",
  "标签不正确!": "Invalid tag!",
  "重复扫描标签自动解除缓存!": "Rescanning the label will automatically clear the cache!",
  "当前到库位库区不存在!": "The current storage location does not exist!",
  "当前原材料不能上架到此库区!": "The current raw materials cannot be stocked in this warehouse area!",
  "当前从库位限制移除!": "Current location restriction removed!",
  "当前到库位限制移入!": "Current location limit reached for moving in!",
  "备料单不可用!": "Material list unavailable!",
  "备料量不能大于需求量!": "The preparation quantity cannot exceed the required quantity!",
  "备料完成!": "Material preparation completed!",
  "零件和备料单不匹配!": "Parts and material list do not match!",
  "请扫码更早批次的标签!": "Please scan the label from an earlier batch!",
  "当前零件已经超量，请换其他零件!": "The current part is overstocked, please use another part!",
  "当前金属件在当前产线没有配置拉动参数!": "The current metal part does not have pull parameters configured on the current production line!",
  "器具码不存在!": "The equipment code does not exist!",
  "标签不在当前备料单中!": "The label is not in the current material list!",
  "从库位没有足够此批次的零件移库!": "There are not enough parts of this batch in the storage location for transfer!",
  "当前标签已经在到库位下面了!": "The current label is already under the destination location!",
  "不能提交空数据!": "Cannot submit empty data!",
  "还有标签未收货，如果需要差异收货，请到PC上面操作!": "There are still tags not received. If you need to process discrepancy receipts, please operate on the PC!",
  "转移量不能大于需求量!": "The transfer amount cannot exceed the demand!",
  "器具码和备料单不匹配!": "The equipment code does not match the material preparation list!",
  "叫料量不能大于最大存放量!": "The requested material quantity cannot exceed the maximum storage capacity!",
  "零件号不存在!": "Part number does not exist!",
  "下线库位不能为空!": "The offline storage location cannot be empty!",
  "总成BOM缺失，无法下线!": "Assembly BOM missing, unable to proceed with production!",
  "成品不能重复下线!": "Finished products cannot be taken offline repeatedly!",
  "下线成功!": "Logout successful!",
  "条码格式错误!": "Barcode format error!",
  "条码解析失败，对应的零件号不存在!": "Barcode parsing failed, corresponding part number does not exist!",
  "当前零件不能上架到此库区!": "The current part cannot be placed in this storage area!",
  "当前成品已经在到库位下面了!": "The current finished product is already under the storage location!",
  "标签没有打包，请先打包!": "Labels are not packaged, please package them first!",
  "解绑完成!": "Unbinding completed!",
  "标签已经解绑注销，不能再次解绑!": "The tag has already been unbound and deactivated, it cannot be unbound again!",
  "标签已经销售发运，不能解绑!": "The tag has already been sold and shipped, it cannot be unbound!",
  "请先上架，然后在解绑!": "Please list it first, then unbind!",
  "当前标签线边库，请先移库到线边库!": "The current label is in the line-side warehouse. Please move it to the line-side warehouse first!",
  "没有缓存扫描任何标签!": "No cached scan of any tags!",
  "合格品不能移动到废弃品库!": "Qualified products cannot be moved to the scrap warehouse!",
  "没有足够的线边库存做此业务!": "Insufficient line-side inventory to perform this operation!",
  "到库位不合法!": "Invalid destination location!",
  "标签或标签状态不正确!": "Incorrect tag or tag status!",
  "标签未打印不能上架!": "Labels not printed, cannot be shelved!",
  "标签未执行完工下线，请先下线!": "The tag has not completed the offline process, please go offline first!",
  "标签已经上架，不能重复上架!": "The tag has already been listed and cannot be listed again!",
  "当前成品不能上架到此库区!": "The current product cannot be placed in this storage area!",
  "移库成功!": "Stock transfer successful!",
  "不能从线边使用此功能!": "This feature cannot be used from the line side!",
  "请先扫描到库位!": "Please scan the storage location first!",
  "标签状态不正确!": "Incorrect tag status!",
  "当前订单对应的客户没有维护寄存库位!": "The customer associated with the current order has not maintained a storage location!",
  "当前没有需要提交的标签，请先扫描标签!": "There are currently no tags to submit. Please scan the tags first!",
  "请下架推荐的标签!": "Please remove the recommended tags!",
  "当前订单行不能超量发运!": "The current order line cannot be over-shipped!",
  "下架完成!": "Unlisted successfully!",
  "销售单号不合法 !": "Invalid sales order number!",
  "标签零件和订单行不匹配!": "Label parts and order lines do not match!",
  "标签重复备料扫描!": "Duplicate label material scanning!",
  "标签还没有上架!": "The label has not been listed yet!",
  "请扫描推荐的标签!": "Please scan the recommended tags!",
  "上一张箱码没有点击领料按钮!": "The previous box code did not click the material picking button!",
  "单箱数量已经超出本次发运量!": "The quantity per box has exceeded the shipment quantity!",
  "不能超量备料!": "Do not exceed the material limit!",
  "无效的的扫描指令 !": "Invalid scan command!",
  "当前单据没有缓存的备料信息 !": "No cached material information for the current document!",
  "' + @Unfinish10082 + N'未完成备料!": "' + @Unfinish10082 + N'Unfinished material preparation!",
  "发运完成!": "Shipment completed!",
  "当前箱码不在成品货架，不能出库!": "The current box code is not on the finished goods shelf and cannot be shipped out!",
  "当前客户的当前零件没有维护扩展信息!": "No extended information is maintained for the current part of the current customer!",
  "当前箱码不在推荐的列表中，不能出库!": "The current box code is not on the recommended list and cannot be shipped out!",
  "' + @Unfinish10116 + N'未完成备料!": "' + @Unfinish10116 + N'Unfinished material preparation!",
  "标签数量不能为空!": "The number of tags cannot be empty!",
  "盘盈标签，请单独摆放!": "Surplus label, please place separately!",
  "源库位是' + @xxbad_loc + N',与盘点库位不一致!": "The source location is ' + @xxbad_loc + N', which is inconsistent with the inventory location!",
  "标签已经被' + @checkuser + N'盘点!": "The tag has already been inventoried by ' + @checkuser + N'!",
  "标签已经被' + @checkuser10094 + N'盘点!": "The tag has already been inventoried by ' + @checkuser10094 + N'!",
  "标签数量修改成功!": "Tag quantity successfully modified!",
  "标签不在货架上!": "The label is not on the shelf!",
  "标签已经被' + @checkuser10040 + N'盘点!": "The tag has already been inventoried by ' + @checkuser10040 + N'!",
  "库位不在本次盘点单中!": "The storage location is not included in this inventory list!",
  "本盘点单已经关闭，不能继续盘点了!": "This inventory list has been closed and cannot be continued!",
  "标签已经被' + @checkuser10041 + N'盘点!": "The tag has already been inventoried by ' + @checkuser10041 + N'!",
  "标签无盘点记录!": "No inventory records for the tag!",
  "没有扫描箱标签，请先扫描箱标签!": "No box label scanned. Please scan the box label first!",
  "原因代码不能为空!": "The reason code cannot be empty!",
  "请扫描标签，然后输入本次领用量!": "Please scan the label and then enter the quantity for this usage!",
  "不能大于本箱的总数量!": "Cannot exceed the total quantity of this box!",
  "本次领用量不能超出计划量!": "The amount for this requisition cannot exceed the planned quantity!",
  "计划外出库号不能为空，请重新选择!": "The unplanned outbound number cannot be empty. Please select again!",
  "原因代码不能为空，请检查!": "The reason code cannot be empty, please check!",
  "当前零件超出需求量!": "The current part exceeds the required quantity!",
  "零件号不匹配!": "Part number mismatch!",
  "累计领用量不能超出计划量!": "The cumulative usage cannot exceed the planned amount!",
  "领料成功!": "Material requisition successful!",
  "出库单状态不正确!": "The status of the delivery order is incorrect!",
  "当前标签不在计划外内!": "The current label is not within the planned scope!",
  "计划外号不能为空，请重新选择!": "The unplanned number cannot be empty, please select again!",
  "标签已经入库!": "The label has already been stored!",
  "标签关联的入库单的状态不正确!": "The status of the associated receipt for the tag is incorrect!",
  "入库完成!": "Storage completed!",
  "标签关联的入库单的未打印!": "The associated receipt of the label has not been printed!",
  "标签关联的入库单的未审批通过!": "The associated warehouse receipt for the tag has not been approved!",
  "' + @xxbad_toloc + N' 发货到库位不存在!": "' + @xxbad_toloc + N' The shipping location does not exist!",
  "' + @Unfinish10050 + N'未完成备料!": "' + @Unfinish10050 + N'Unfinished material preparation!",
  "从库位和到库位的库区相同，不能出库!": "The source and destination storage areas are the same, cannot proceed with the outbound process!",
  "领用数量不能为0!": "The quantity received cannot be 0!",
  "当前零件超出需求量，请先拆箱!": "The current part exceeds the required quantity, please unpack first!",
  "当前箱标签数量为0!": "The current number of box labels is 0!",
  "必须从指定库位下面扫描当前零件!": "You must scan the current part from the specified location!",
  "入库单未打印，请先打印入库单再入库!": "The warehouse receipt has not been printed. Please print the warehouse receipt before proceeding with the storage!",
  "入库单状态不正确，请检查入库单状态!": "The status of the inbound order is incorrect. Please check the status of the inbound order!",
  "工号不正确!": "Incorrect employee ID!",
  "请先退出生产班组!": "Please exit the production team first!",
  "请先选择小组!": "Please select a group first!",
  "当前加工波次不需要结束!": "The current processing batch does not need to end!",
  "当前小组没有任何人员!": "There are no members in the current group!",
  "必须选择工艺!": "You must select a process!",
  "加工单不正确!": "Processing order is incorrect!",
  "请先选择班组!": "Please select a team first!",
  "当前班组不能重复生产当前工单!": "The current team cannot repeatedly produce the current work order!",
  "前工程当前班组正在生产其他工单!": "The previous process's current team is working on another order!",
  "当前零件当前批次线边库存不足，请核查!": "Current batch line-side inventory of the part is insufficient, please check!",
  "系统出错，生成的标签为空!": "System error, generated label is empty!",
  "复制成功!": "Copy successful!",
  "必须是上架到仓库的箱码才能移库!": "Only box codes that are stocked in the warehouse can be transferred!",
  "标签没有关联到订单行，不能退货!": "The label is not associated with the order line, return is not possible!",
  "必须是销售出去的标签，才能退货!": "Only sold tags can be returned!",
  "暂停这个功能的使用，请使用其他功能!": "This feature is temporarily unavailable. Please use other features!",
  "从库位和到库位的库区相同，不能使用此功能!": "The source and destination storage areas are the same, this function cannot be used!",
  "从库位必须是产线库位!": "The source location must be a production line location!",
  "必须选择是否合格!": "You must select whether it is qualified!",
  "包装量不能为空或者0!": "The packaging quantity cannot be empty or zero!",
  "产线的下线库位不存在!": "The offline storage location of the production line does not exist!",
  "零件描述不能为空!": "The part description cannot be empty!",
  "必须输入不合格原因!": "The reason for disqualification must be entered!",
  "' + @lesspart10072 + N'预判断线边库存不足，无法下线!": "' + @lesspart10072 + N'Pre-judgment: Insufficient line-side inventory, unable to proceed!",
  "' + ISNULL(@xxbad_extension3, '') + N'下线成功!": "' + ISNULL(@xxbad_extension3, '') + N'Offline successfully!",
  "加工单不存在!": "The processing order does not exist!",
  "请输入入箱批次和数量!": "Please enter the batch number and quantity!",
  "箱标签不能超量打包!": "Box labels cannot be overpacked!",
  "此功能已经废弃，请使用并箱功能!": "This feature has been deprecated. Please use the merge function!",
  "箱标签不合法!": "Invalid box label!",
  "箱码或箱码状态不正确!": "The box code or box code status is incorrect!",
  "箱码已经回冲了!": "The box code has already been reversed!",
  "下线批次不能为空!": "The offline batch cannot be empty!",
  "' + @lesspart + N'线边库存不足，无法下线!": "' + @lesspart + N'Insufficient line-side inventory, unable to go offline!",
  "加工单已经关闭或者删除，无法下线!": "The work order has been closed or deleted and cannot be taken offline!",
  "QAD加工单已经删除，无法下线!": "The QAD processing order has been deleted and cannot be taken offline!",
  "' + @lesspart10021 + N'线边库存不足，无法下线!": "' + @lesspart10021 + N'Insufficient line-side inventory, unable to proceed offline!",
  "上一个标签还没有提交，请先提交或者解除!": "The previous tag has not been submitted yet. Please submit or cancel it first!",
  "故障类型不能为空!": "The fault type cannot be empty!",
  "报修成功!": "Repair request submitted successfully!",
  "设备编码不存在!": "Device code does not exist!",
  "报修单号不正确!": "The repair order number is incorrect!",
  "故障原因不能为空!": "The cause of the malfunction cannot be empty!",
  "报修单号不存在!": "The repair order number does not exist!",
  "箱码不正确!": "Incorrect box code!",
  "箱码还没回冲，无法反向回冲!": "The box code has not been recharged yet, reverse recharge is not possible!",
  "标签当前库位必须在产线库位!": "The label's current location must be in the production line location!",
  "总成BOM缺失，无法反向回冲!": "Assembly BOM missing, unable to backflush!",
  "没有找到正向回冲记录，无法反向回冲!": "No forward charge record found, unable to reverse charge!",
  "加工单已经关闭或者删除，无法反向回冲!": "The processing order has been closed or deleted, reverse charge is not possible!",
  "此功能已经下线，不再使用!": "This feature has been discontinued and is no longer available!",
  "标签批次不正确!": "Incorrect label batch!",
  "标签还没有领用，不能上料!": "The label has not been issued yet, material cannot be loaded!",
  "请先扫码加工单号!": "Please scan the processing order number first!",
  "请先扫码物料号!": "Please scan the material number first!",
  "请输入分摊数量!": "Please enter the allocation quantity!",
  "加工单不合法!": "The processing order is invalid!",
  "当前物料不在在加工单BOM中!": "The current material is not in the processing order BOM!",
  "请提交已经扫描的标签!": "Please submit the scanned label!",
  "请领用刚刚扫描的箱码标签!": "Please collect the recently scanned box code label!",
  "请输入本箱领用量!": "Please enter the usage amount for this box!",
  "请先扫描箱码!": "Please scan the box code first!",
  "成品领料单不允许超额发料!": "Finished goods requisition form does not allow over-issuance!",
  "当前领料单当前行已结束!": "The current line of the material requisition has ended!",
  "领料到库位不能为空!": "The storage location for material requisition cannot be empty!",
  "领用数量不能超出本箱数量!": "The quantity received cannot exceed the quantity in this box!",
  "不能重复提交标签!": "Duplicate tag submission is not allowed!",
  "本箱领料出库成功!": "Material issuance from this box was successful!",
  "零件不包含在领料单中!": "The part is not included in the picking list!",
  "请先选择领料单号!": "Please select the material requisition number first!",
  "请先选择零件号!": "Please select a part number first!",
  "系统故障!": "System failure!",
  "请按照批次顺序扫描标签!": "Please scan the labels in batch order!",
  "当前标签不在线边库位!": "The current label is not in the edge storage location!",
  "请输入本次退库量!": "Please enter the return quantity!",
  "退库量不能大于箱标签数量!": "The return quantity cannot exceed the number of box labels!",
  "标签移库成功!": "Label transfer successful!",
  "本托还没有装满，请继续组托!": "The pallet is not fully loaded yet, please continue stacking!",
  "组托完成!": "Group creation completed!",
  "标签不能重复组托!": "Tags cannot be duplicated in the group!",
  "当前客户当前零件的编码规则没有维护，请先维护!": "The coding rules for the current part of the current customer have not been maintained. Please maintain them first!",
  "生成新的托号为空，请联系管理员!": "The new tracking number is empty, please contact the administrator!",
  "生成新的托号重复，请联系管理员!": "Duplicate new order number generated, please contact the administrator!",
  "当前标签和上一个标签不是同一个零件号和客户编码，库位  不能混装!": "The current label and the previous label do not have the same part number and customer code. The storage location cannot be mixed!",
  "本托已经装满，请提交数据!": "The bento box is full, please submit the data!",
  "从库位没有足够的库存做此业务!": "There is not enough stock in the location to perform this operation!",
  "当前成品不能移库到此库区!": "The current finished product cannot be moved to this storage area!",
  "拆托完成!": "Dismantling completed!",
  "托标签不正确!": "Incorrect tag!",
  "功能已经废弃，重新做!": "The feature has been deprecated, please redo it!",
  "回冲数量不能为空!": "The recharge quantity cannot be empty!",
  "当前原材料零件当前批次线边库存不足，请核查!": "The current batch of raw material parts has insufficient line-side inventory. Please check!",
  "回冲成功!": "Reversal successful!",
  "当前箱码没有回冲记录!": "No backflush record for the current box code!",
  "绑定成功!": "Binding successful!",
  "' + @ErrorMessage + N'": "' + @ErrorMessage + N'"
}